<h1>Tema 20. Redes de comunicaciones III.</h1>
<h2>20.1. Equipos de comunicaciones y elementos de interconexi&oacute;n de redes.</h2>
<p>Estos componentes son esenciales para el dise&ntilde;o, implementaci&oacute;n y funcionamiento de las redes de
    comunicaci&oacute;n, ya sean redes locales (LAN), redes de &aacute;rea extensa (WAN), redes inal&aacute;mbricas,
    entre otras.</p>
<h3>Equipos de Comunicaciones</h3>
<p>Los equipos de comunicaciones son dispositivos utilizados para transmitir, recibir, amplificar o procesar
    se&ntilde;ales de datos en una red. Algunos de los equipos m&aacute;s comunes incluyen:</p>
<h4>- Routers (Enrutadores):</h4>
<p>Los routers son dispositivos que encaminan paquetes de datos entre diferentes redes. Permiten la conexi&oacute;n de
    m&uacute;ltiples redes y aseguran que los datos lleguen a su destino correcto a trav&eacute;s de la ruta m&aacute;s
    eficiente. Utilizan protocolos de enrutamiento como OSPF, BGP, EIGRP, entre otros.</p>
<h4>- Switches (Conmutadores):</h4>
<p>Los switches son dispositivos que conectan dispositivos dentro de una misma red (por ejemplo, una LAN) y permiten la
    comunicaci&oacute;n directa entre ellos. Operan en la capa de enlace de datos (Capa 2 del modelo OSI) y, en algunos
    casos, tambi&eacute;n en la capa de red (Capa 3). Los switches pueden ser administrables (con configuraci&oacute;n
    avanzada) o no administrables (configuraci&oacute;n b&aacute;sica).</p>
<h4>- Access Points (Puntos de Acceso Inal&aacute;mbrico):</h4>
<p>Son dispositivos que permiten la conexi&oacute;n de dispositivos inal&aacute;mbricos a una red cableada.
    Act&uacute;an como un puente entre la red cableada y los dispositivos m&oacute;viles, como tel&eacute;fonos
    inteligentes, laptops, etc.</p>
<h4>- Firewalls (Cortafuegos):</h4>
<p>Son dispositivos de seguridad que supervisan y controlan el tr&aacute;fico de red entrante y saliente. Los firewalls
    pueden ser de software o hardware y est&aacute;n dise&ntilde;ados para proteger la red de accesos no autorizados,
    ataques, y otros riesgos de seguridad.</p>
<h4>- Modems:</h4>
<p>Los modems (moduladores-demoduladores) son dispositivos que convierten se&ntilde;ales digitales en anal&oacute;gicas
    y viceversa. Son esenciales para la conexi&oacute;n de redes a Internet a trav&eacute;s de tecnolog&iacute;as como
    DSL, cable, fibra &oacute;ptica, etc.</p>
<h4>- Gateways:</h4>
<p>Act&uacute;an como "puertas de enlace" que conectan redes que operan bajo diferentes protocolos de
    comunicaci&oacute;n. Son especialmente &uacute;tiles en entornos donde se necesita la integraci&oacute;n de
    diferentes tipos de redes.</p>
<h3>Elementos de Interconexi&oacute;n de Redes</h3>
<p>Los elementos de interconexi&oacute;n de redes son los componentes que permiten la comunicaci&oacute;n y
    transferencia de datos entre diferentes redes. Algunos de los elementos de interconexi&oacute;n m&aacute;s
    importantes incluyen:</p>
<h4>- Hubs (Concentradores):</h4>
<p>Son dispositivos b&aacute;sicos de interconexi&oacute;n que env&iacute;an datos a todos los puertos, sin importar el
    destino. Son menos eficientes que los switches porque generan m&aacute;s tr&aacute;fico en la red.</p>
<h4>- Bridges (Puentes):</h4>
<p>Los puentes conectan dos segmentos de red a nivel de capa de enlace de datos. Filtran el tr&aacute;fico de red para
    reducir la congesti&oacute;n y mejorar el rendimiento.</p>
<h4>- Gateways:</h4>
<p>Act&uacute;an como traductores de protocolos, conectando dos redes que pueden tener diferentes tecnolog&iacute;as de
    comunicaci&oacute;n. Un ejemplo t&iacute;pico es un gateway que conecta una red IP a una red telef&oacute;nica.</p>
<h4>- Repeaters (Repetidores):</h4>
<p>Son dispositivos que amplifican la se&ntilde;al para que pueda viajar distancias m&aacute;s largas. Se utilizan en
    redes donde la se&ntilde;al puede debilitarse debido a la distancia o interferencia.</p>
<h4>- Backbones (Espinas Dorsales):</h4>
<p>Son los "troncos" principales de una red que conectan m&uacute;ltiples redes m&aacute;s peque&ntilde;as o subredes.
    Los backbones suelen tener un gran ancho de banda para manejar grandes cantidades de tr&aacute;fico de datos.</p>
<h3>Resumen</h3>
<p>La combinaci&oacute;n de equipos de comunicaciones y elementos de interconexi&oacute;n de redes es fundamental para
    dise&ntilde;ar redes eficientes, seguras y escalables. Estos componentes trabajan juntos para asegurar la
    conectividad, el rendimiento y la seguridad de las comunicaciones dentro de cualquier tipo de red.</p>
<h2>20.2. Principales requisitos a tener en cuenta en la adquisici&oacute;n de estos equipos.</h2>
<p>La adquisici&oacute;n de equipos de comunicaciones y elementos de interconexi&oacute;n de redes es una
    decisi&oacute;n cr&iacute;tica para cualquier organizaci&oacute;n, ya que afecta directamente la eficiencia,
    seguridad, escalabilidad y fiabilidad de la red. A continuaci&oacute;n, te detallo los principales requisitos que
    deben considerarse al adquirir estos equipos:</p>
<h3>1. Requisitos de Capacidad y Rendimiento</h3>
<p>- Ancho de Banda: Eval&uacute;a la cantidad de tr&aacute;fico de datos que el equipo puede manejar. Por ejemplo, un
    switch o router debe ser capaz de manejar el tr&aacute;fico m&aacute;ximo esperado sin colapsar. Esto incluye
    considerar la cantidad de puertos, velocidad de los puertos (10/100/1000 Mbps o 10 Gbps), y la capacidad de
    conmutaci&oacute;n en el caso de switches.</p>
<p>- Latencia y Retardo: Es crucial que los equipos mantengan una latencia baja para aplicaciones sensibles al tiempo,
    como videoconferencias, VoIP o servicios de transmisi&oacute;n en tiempo real.</p>
<p>- Escalabilidad: Considera equipos que puedan crecer junto con la red. Los dispositivos modulares que permiten
    agregar m&aacute;s puertos, m&oacute;dulos de expansi&oacute;n o mejoras de firmware son una buena opci&oacute;n
    para redes en expansi&oacute;n.</p>
<h3>2. Compatibilidad y Est&aacute;ndares</h3>
<p>- Compatibilidad con Protocolos y Est&aacute;ndares: Aseg&uacute;rate de que los equipos soporten los protocolos y
    est&aacute;ndares de red necesarios para tu infraestructura (como IPv4/IPv6, VLAN, QoS, etc.). Esto es especialmente
    importante en entornos heterog&eacute;neos donde pueden coexistir diferentes tipos de dispositivos y
    tecnolog&iacute;as.</p>
<p>- Interoperabilidad: Los equipos deben ser compatibles con otros dispositivos de diferentes fabricantes que ya
    existan en la red, especialmente en grandes redes corporativas donde el cambio de todo el hardware puede no ser
    factible.</p>
<h3>3. Seguridad</h3>
<p>- Capacidades de Seguridad Integradas: Busca equipos que soporten caracter&iacute;sticas avanzadas de seguridad, como
    firewalls integrados, VPN, autenticaci&oacute;n 802.1X, listas de control de acceso (ACL), prevenci&oacute;n de
    intrusiones (IPS), y detecci&oacute;n de intrusiones (IDS).</p>
<p>- Gesti&oacute;n de Seguridad: Considera la facilidad con la que los equipos permiten gestionar la seguridad. Algunos
    dispositivos ofrecen gesti&oacute;n centralizada que puede simplificar la configuraci&oacute;n de pol&iacute;ticas
    de seguridad en toda la red.</p>
<p>- Actualizaciones de Firmware y Soporte de Seguridad: Verifica que el proveedor del equipo tenga un historial
    s&oacute;lido de actualizaciones de seguridad y soporte a largo plazo.</p>
<h3>4. Facilidad de Gesti&oacute;n y Mantenimiento</h3>
<p>- Interfaz de Gesti&oacute;n: La gesti&oacute;n eficiente del equipo es crucial. Los dispositivos deben ofrecer
    interfaces de administraci&oacute;n intuitivas y flexibles, como GUI basadas en web, CLI (l&iacute;nea de comandos),
    o mediante protocolos de administraci&oacute;n de red como SNMP, NetFlow, etc.</p>
<p>- Herramientas de Monitorizaci&oacute;n y Diagn&oacute;stico: Equipos con caracter&iacute;sticas de
    monitorizaci&oacute;n, generaci&oacute;n de informes y herramientas de diagn&oacute;stico ayudan a detectar
    problemas antes de que afecten a la red.</p>
<p>- Documentaci&oacute;n y Soporte T&eacute;cnico: Es importante que el proveedor ofrezca una buena
    documentaci&oacute;n, soporte t&eacute;cnico confiable y recursos de formaci&oacute;n, especialmente para el
    personal de TI.</p>
<h3>5. Costo Total de Propiedad (TCO)</h3>
<p>- Costo Inicial vs. Costo a Largo Plazo: Aparte del precio de compra, considera los costos a largo plazo, como el
    mantenimiento, actualizaciones de firmware, licencias de software, energ&iacute;a, refrigeraci&oacute;n, y soporte.
</p>
<p>- Licenciamiento de Caracter&iacute;sticas: Algunos fabricantes pueden cobrar licencias adicionales para
    caracter&iacute;sticas espec&iacute;ficas, como enrutamiento avanzado, firewall, o capacidades de VPN. Es importante
    conocer estos detalles para evitar costos ocultos.</p>
<h3>6. Confiabilidad y Resiliencia</h3>
<p>- Redundancia y Alta Disponibilidad: Considera equipos que ofrezcan opciones de redundancia, como fuentes de
    alimentaci&oacute;n dobles, ventiladores reemplazables en caliente, o configuraciones de cluster para failover
    autom&aacute;tico. Esto es esencial para mantener la continuidad del negocio.</p>
<p>- Tasa de Fallos y Garant&iacute;as: Revisa la tasa de fallos del equipo y las garant&iacute;as ofrecidas por el
    fabricante. Los equipos de comunicaciones deben ser robustos y ofrecer garant&iacute;as extendidas y acuerdos de
    nivel de servicio (SLA).</p>
<h3>7. Capacidades de Red Avanzadas</h3>
<p>- Calidad de Servicio (QoS): Es esencial en entornos donde el tr&aacute;fico de red debe ser priorizado (por ejemplo,
    tr&aacute;fico de voz y video frente a tr&aacute;fico de datos).</p>
<p>- Soporte para Virtualizaci&oacute;n de Redes: En redes modernas, especialmente en centros de datos y entornos en la
    nube, el soporte para SDN (redes definidas por software) y virtualizaci&oacute;n de funciones de red (NFV) puede ser
    crucial.</p>
<h3>8. Escenarios Espec&iacute;ficos de Uso</h3>
<p>- Ambiente de Trabajo: Considera factores ambientales como el tama&ntilde;o, la temperatura de funcionamiento, la
    resistencia al polvo o agua (en el caso de equipos para exteriores), y el nivel de ruido, especialmente en entornos
    industriales o lugares de trabajo sensibles.</p>
<p>- Movilidad y Conectividad Inal&aacute;mbrica: Para redes que requieren conectividad inal&aacute;mbrica, los puntos
    de acceso deben soportar los est&aacute;ndares Wi-Fi m&aacute;s recientes (como Wi-Fi 6 o 6E) y
    caracter&iacute;sticas avanzadas como MIMO, beamforming, y seguridad WPA3.</p>
<h3>9. Reputaci&oacute;n del Fabricante y Soporte Comunitario</h3>
<p>- Reputaci&oacute;n del Fabricante: Investiga la reputaci&oacute;n del fabricante en cuanto a confiabilidad, soporte
    postventa y disponibilidad de actualizaciones.</p>
<p>- Soporte Comunitario y Foros: Un fuerte soporte comunitario puede ser invaluable para solucionar problemas o
    aprender de la experiencia de otros usuarios.</p>
<h3>Conclusi&oacute;n</h3>
<p>La adquisici&oacute;n de equipos de comunicaciones y elementos de interconexi&oacute;n de redes debe basarse en un
    an&aacute;lisis exhaustivo de los requisitos t&eacute;cnicos, de seguridad, financieros y de gesti&oacute;n. Al
    considerar estos aspectos, es posible asegurar una red robusta, segura y adaptable que satisfaga las necesidades
    actuales y futuras de la organizaci&oacute;n.</p>
<h2>20.3. Sistemas de cableado estructurado. Tipos de cables de red.</h2>
<p>El cableado estructurado es un sistema estandarizado de cables y componentes que permite la transmisi&oacute;n de
    datos, voz, video y se&ntilde;ales de control a trav&eacute;s de una red. Es la infraestructura f&iacute;sica sobre
    la que se construyen las redes de comunicaci&oacute;n en edificios, oficinas, centros de datos, etc.</p>
<p>Uno de los aspectos m&aacute;s importantes del cableado estructurado es la elecci&oacute;n del tipo de cable de red
    adecuado. Los tipos de cables de red m&aacute;s utilizados incluyen cables de cobre y cables de fibra &oacute;ptica.
    A continuaci&oacute;n, te proporciono una descripci&oacute;n detallada de cada tipo de cable, sus
    caracter&iacute;sticas, aplicaciones y ventajas.</p>
<p>Tipos de Cables de Red</p>
<h3>1. Cables de Cobre</h3>
<p>Los cables de cobre son los m&aacute;s utilizados en redes locales (LAN) debido a su coste relativamente bajo y
    facilidad de instalaci&oacute;n. Dentro de los cables de cobre, los m&aacute;s comunes son:</p>
<h4>a) Cables de Par Trenzado</h4>
<p>Los cables de par trenzado consisten en pares de cables de cobre trenzados entre s&iacute; para reducir la
    interferencia electromagn&eacute;tica. Este tipo de cable se divide en varias categor&iacute;as, las m&aacute;s
    relevantes son:</p>
<p>- Categor&iacute;a 5e (Cat 5e):</p>
<ul>
    <li>Es la versi&oacute;n mejorada del Cat 5. Soporta velocidades de hasta 1 Gbps (Gigabit Ethernet) y frecuencias de
        hasta 100 MHz.</li>
    <li>Es ampliamente utilizado para redes LAN en entornos residenciales y comerciales.</li>
    <li>Limitado a distancias de hasta 100 metros.</li>
</ul>
<p>- Categor&iacute;a 6 (Cat 6):</p>
<ul>
    <li>Soporta velocidades de hasta 10 Gbps a distancias de hasta 55 metros y frecuencias de hasta 250 MHz.</li>
    <li>Utilizado en entornos que requieren mayor ancho de banda, como centros de datos y aplicaciones de video en alta
        definici&oacute;n.</li>
    <li>Tiene un mayor grosor y aislamiento en comparaci&oacute;n con Cat 5e, lo que reduce el ruido y la
        diafon&iacute;a.</li>
</ul>
<p>- Categor&iacute;a 6a (Cat 6a):</p>
<ul>
    <li>Soporta velocidades de hasta 10 Gbps a distancias de hasta 100 metros y frecuencias de hasta 500 MHz.</li>
    <li>Ofrece mejor protecci&oacute;n contra la diafon&iacute;a y las interferencias externas, siendo adecuado para
        aplicaciones de red m&aacute;s exigentes y entornos de alta densidad.</li>
</ul>
<p>- Categor&iacute;a 7 (Cat 7):</p>
<ul>
    <li>Soporta velocidades de hasta 10 Gbps y frecuencias de hasta 600 MHz. Su longitud m&aacute;xima recomendada es de
        100 metros.</li>
    <li>Cada par de cables est&aacute; blindado individualmente y el cable en su conjunto tambi&eacute;n, proporcionando
        una excelente protecci&oacute;n contra la interferencia.</li>
    <li>Se utiliza en aplicaciones que requieren un alto nivel de inmunidad al ruido, como estudios de grabaci&oacute;n,
        aplicaciones industriales y centros de datos.</li>
</ul>
<p>- Categor&iacute;a 8 (Cat 8):</p>
<ul>
    <li>Es el est&aacute;ndar m&aacute;s reciente de cables de cobre de par trenzado. Soporta velocidades de hasta 25
        Gbps y 40 Gbps en distancias de hasta 30 metros.</li>
    <li>Utilizado principalmente en centros de datos donde se requieren conexiones de alta velocidad y baja latencia.
    </li>
    <li>Funciona a frecuencias de hasta 2000 MHz y proporciona un blindaje superior para entornos de alta interferencia.
    </li>
</ul>
<h4>b) Cables Coaxiales</h4>
<p>Aunque son menos comunes en las redes LAN modernas, los cables coaxiales se siguen utilizando para ciertos tipos de
    conexiones, como sistemas de televisi&oacute;n por cable, c&aacute;maras de seguridad y aplicaciones industriales.
</p>
<p>Tienen un n&uacute;cleo conductor central rodeado por un aislamiento, una malla met&aacute;lica y un revestimiento
    externo. Ofrecen buena resistencia a la interferencia electromagn&eacute;tica.</p>
<h3>2. Cables de Fibra &Oacute;ptica</h3>
<p>Los cables de fibra &oacute;ptica utilizan fibras de vidrio o pl&aacute;stico para transmitir datos como pulsos de
    luz, lo que permite velocidades de transmisi&oacute;n muy altas y a largas distancias con baja atenuaci&oacute;n. Se
    dividen principalmente en dos tipos:</p>
<h4>a) Fibra &Oacute;ptica Monomodo (Single-Mode Fiber - SMF)</h4>
<p>- Transmite un &uacute;nico modo de luz. Se utiliza para largas distancias, como enlaces troncales entre ciudades,
    redes metropolitanas y aplicaciones de larga distancia.<br /> <br /> - Tiene un n&uacute;cleo m&aacute;s
    peque&ntilde;o (alrededor de 9 micr&oacute;metros) y soporta distancias de hasta 100 km sin necesidad de
    repetidores.</p>
<p>- Soporta velocidades de hasta 100 Gbps o m&aacute;s, dependiendo de la tecnolog&iacute;a utilizada.</p>
<h4>b) Fibra &Oacute;ptica Multimodo (Multi-Mode Fiber - MMF)</h4>
<p>- Transmite m&uacute;ltiples modos de luz simult&aacute;neamente, lo que puede provocar dispersi&oacute;n modal y
    limitar la distancia de transmisi&oacute;n.</p>
<p>- Tiene un n&uacute;cleo m&aacute;s grande (50 o 62.5 micr&oacute;metros) y es ideal para distancias m&aacute;s
    cortas (hasta 2 km).</p>
<p>- Utilizado en redes de &aacute;rea local (LAN), centros de datos y enlaces de campus.</p>
<p>- Las subcategor&iacute;as de MMF incluyen OM1, OM2, OM3, OM4, y OM5, que var&iacute;an en t&eacute;rminos de ancho
    de banda y distancia de transmisi&oacute;n. Por ejemplo, OM3 y OM4 son adecuados para 10 Gbps, 40 Gbps y 100 Gbps.
</p>
<h3>3. Cables de Fibra &Oacute;ptica de Categor&iacute;a Especial</h3>
<p>- Cables Armados: Tienen una capa adicional de protecci&oacute;n contra da&ntilde;os f&iacute;sicos, utilizados en
    entornos industriales.</p>
<p>- Cables para Exteriores: Dise&ntilde;ados para resistir condiciones ambientales extremas, como cambios de
    temperatura, humedad, y exposici&oacute;n a qu&iacute;micos.</p>
<h4>Factores a Considerar en la Selecci&oacute;n de Cables de Red</h4>
<p>Al seleccionar el tipo de cable de red para un sistema de cableado estructurado, se deben considerar los siguientes
    factores:</p>
<p>- Distancia de Transmisi&oacute;n: Los cables de cobre tienen limitaciones de distancia (generalmente 100 metros),
    mientras que los cables de fibra &oacute;ptica pueden cubrir distancias mucho mayores.</p>
<p>- Velocidad y Ancho de Banda: Dependiendo de la necesidad de velocidad y ancho de banda, se pueden seleccionar cables
    de diferentes categor&iacute;as (Cat 5e, Cat 6, Cat 6a, etc.) o fibra &oacute;ptica.</p>
<p>- Ambiente de Instalaci&oacute;n: Considera las condiciones del entorno (interferencias electromagn&eacute;ticas,
    temperatura, humedad, riesgo de da&ntilde;os f&iacute;sicos, etc.).</p>
<p>- Costo: Los cables de cobre son generalmente m&aacute;s baratos que los de fibra &oacute;ptica, pero el costo a
    largo plazo puede ser m&aacute;s alto si se requiere un mayor mantenimiento o si no se puede cumplir con los
    requisitos de velocidad.</p>
<p>- Futuras Actualizaciones y Escalabilidad: Planifica con anticipaci&oacute;n las posibles expansiones o aumentos de
    ancho de banda para evitar tener que reemplazar el cableado en el futuro.</p>
<h3>Conclusi&oacute;n</h3>
<p>La elecci&oacute;n del tipo de cable de red adecuado es crucial para garantizar el rendimiento, la fiabilidad y la
    escalabilidad de una red. Considerar los requisitos espec&iacute;ficos del entorno, el rendimiento deseado y el
    presupuesto ayudar&aacute; a seleccionar el sistema de cableado estructurado m&aacute;s adecuado.</p>