<h1>Tema 35. Tecnolog&iacute;as Web de Front-End.</h1>
<h2>35.1. XML, Html5, CSS.</h2>
<h3>1. XML (eXtensible Markup Language)</h3>
<p>- Definici&oacute;n: XML es un lenguaje de marcado que se utiliza para almacenar y transportar datos. Es extensible,
    lo que significa que puedes definir tus propias etiquetas.</p>
<p>- Caracter&iacute;sticas:</p>
<ul>
    <li>No tiene un conjunto de etiquetas predefinidas; los desarrolladores definen las etiquetas seg&uacute;n sus
        necesidades.</li>
    <li>XML es tanto legible para humanos como para m&aacute;quinas, lo que lo hace adecuado para intercambiar datos
        entre sistemas diferentes.</li>
    <li>Utiliza una estructura jer&aacute;rquica (basada en &aacute;rboles) para organizar los datos.</li>
    <li>No est&aacute; dise&ntilde;ado para mostrar datos como HTML, sino para definir, almacenar y transportar
        informaci&oacute;n.</li>
</ul>
<p>- Usos comunes:</p>
<ul>
    <li>Almacenamiento de datos en archivos de configuraci&oacute;n.</li>
    <li>Intercambio de datos entre servidores y aplicaciones web.</li>
    <li>Formato para feeds de RSS y Atom.</li>
    <li>Base para otros lenguajes de marcado como XHTML y SOAP.</li>
</ul>
<h3>2. HTML5 (HyperText Markup Language, Version 5)</h3>
<p>- Definici&oacute;n: HTML5 es la versi&oacute;n m&aacute;s reciente de HTML, el lenguaje de marcado est&aacute;ndar
    utilizado para crear y estructurar contenido en la web.</p>
<p>- Caracter&iacute;sticas:</p>
<ul>
    <li>Introduce nuevas etiquetas sem&aacute;nticas como &lt;header&gt;, &lt;footer&gt;, &lt;article&gt;,
        &lt;section&gt;, que mejoran la accesibilidad y el SEO (optimizaci&oacute;n de motores de b&uacute;squeda).</li>
    <li>Soporte nativo para elementos multimedia, como &lt;audio&gt; y &lt;video&gt;, eliminando la necesidad de plugins
        externos como Flash.</li>
    <li>Nuevos elementos para formularios, como &lt;input type="date"&gt;, &lt;input type="email"&gt;, &lt;input
        type="range"&gt;, que facilitan la validaci&oacute;n y la interacci&oacute;n del usuario.</li>
    <li>Mejora la integraci&oacute;n con JavaScript a trav&eacute;s de APIs como la API de Canvas (para gr&aacute;ficos
        en 2D), API de Geolocalizaci&oacute;n, API de Almacenamiento Web, etc.</li>
</ul>
<p>- Usos comunes:</p>
<ul>
    <li>Estructuraci&oacute;n del contenido de p&aacute;ginas web.</li>
    <li>Creaci&oacute;n de interfaces de usuario interactivas y enriquecidas.</li>
    <li>Desarrollo de aplicaciones web modernas y progresivas (PWAs).</li>
</ul>
<h3>3. CSS (Cascading Style Sheets)</h3>
<p>- Definici&oacute;n: CSS es un lenguaje de hojas de estilo utilizado para describir la presentaci&oacute;n de un
    documento escrito en HTML o XML. Se utiliza para dar estilo y formato al contenido web.</p>
<p>- Caracter&iacute;sticas:</p>
<ul>
    <li>CSS permite la separaci&oacute;n de la estructura del contenido (HTML) de su presentaci&oacute;n (estilo
        visual), facilitando el mantenimiento y la reutilizaci&oacute;n del c&oacute;digo.</li>
    <li>Utiliza una jerarqu&iacute;a de selectores que permite aplicar estilos espec&iacute;ficos a diferentes elementos
        del DOM (Document Object Model).</li>
    <li>Soporte para dise&ntilde;os responsivos a trav&eacute;s de Media Queries, lo que permite crear sitios web
        adaptables a diferentes tama&ntilde;os de pantalla.</li>
    <li>Introducci&oacute;n de Flexbox y Grid Layout para un control m&aacute;s preciso del dise&ntilde;o de la
        p&aacute;gina y la alineaci&oacute;n de los elementos.</li>
</ul>
<p>- Usos comunes:</p>
<ul>
    <li>Control del dise&ntilde;o, los colores, las fuentes y la disposici&oacute;n general de los elementos en una
        p&aacute;gina web.</li>
    <li>Creaci&oacute;n de animaciones y transiciones para mejorar la interactividad.</li>
    <li>Dise&ntilde;o de interfaces responsivas que se adapten a m&uacute;ltiples dispositivos y tama&ntilde;os de
        pantalla.</li>
</ul>
<h3>&iquest;C&oacute;mo trabajan juntos XML, HTML5 y CSS?</h3>
<p>- HTML5 proporciona la estructura y el contenido de la p&aacute;gina web.<br /> - CSS se utiliza para aplicar estilos
    y dise&ntilde;ar la apariencia visual del contenido estructurado por HTML5.<br /> - XML puede integrarse con HTML y
    otros sistemas como una forma de intercambiar datos. <br /> <br /> Por ejemplo, un sitio web puede usar datos XML
    para rellenar din&aacute;micamente su contenido a trav&eacute;s de JavaScript.</p>
<p>Estas tecnolog&iacute;as son fundamentales para el desarrollo de la web moderna, permitiendo crear p&aacute;ginas web
    ricas, interactivas, adaptativas y con una buena organizaci&oacute;n de datos.</p>
<h2>35.2. JSP, JSF, Javascript.</h2>
<p>Estas tecnolog&iacute;as est&aacute;n relacionadas con el desarrollo de aplicaciones web, pero cada una tiene un
    prop&oacute;sito diferente dentro del ecosistema web.</p>
<h3>1. JSP (JavaServer Pages)</h3>
<p>- Definici&oacute;n: JSP es una tecnolog&iacute;a de Java que permite a los desarrolladores crear contenido
    din&aacute;mico en p&aacute;ginas web utilizando HTML, XML y otros formatos de documentos. Es un servidor de
    tecnolog&iacute;a basada en Java que facilita la creaci&oacute;n de contenido din&aacute;mico en aplicaciones web.
</p>
<p>- Caracter&iacute;sticas:</p>
<ul>
    <li>Combina HTML est&aacute;tico con c&oacute;digo din&aacute;mico basado en Java, lo que permite la creaci&oacute;n
        de p&aacute;ginas web din&aacute;micas.</li>
    <li>Utiliza Servlets de Java en el fondo, pero permite una sintaxis m&aacute;s amigable para los desarrolladores que
        est&aacute;n m&aacute;s acostumbrados a HTML.</li>
    <li>Permite la inclusi&oacute;n de elementos Java directamente en las p&aacute;ginas web utilizando expresiones
        &lt;%= %&gt;, declaraciones &lt;%! %&gt;, y scripts &lt;% %&gt;.</li>
    <li>Admite la reutilizaci&oacute;n de c&oacute;digo a trav&eacute;s de JavaBeans y tag libraries (bibliotecas de
        etiquetas), lo que ayuda a mantener el c&oacute;digo limpio y modular.</li>
</ul>
<p>- Usos comunes:</p>
<ul>
    <li>Creaci&oacute;n de aplicaciones web que necesitan interactuar con bases de datos o realizar c&aacute;lculos del
        lado del servidor.</li>
    <li>Generaci&oacute;n de contenido din&aacute;mico basado en la entrada del usuario o en otras fuentes de datos.
    </li>
    <li>Desarrollo de aplicaciones empresariales basadas en Java que requieren l&oacute;gica del lado del servidor.</li>
</ul>
<h3>2. JSF (JavaServer Faces)</h3>
<p>- Definici&oacute;n: JSF es un marco de trabajo (framework) para la construcci&oacute;n de interfaces de usuario
    basadas en componentes para aplicaciones web Java. Es parte de la plataforma Java EE.</p>
<p>- Caracter&iacute;sticas:</p>
<ul>
    <li>Basado en el concepto de componentes reutilizables de la interfaz de usuario que se pueden definir y
        personalizar f&aacute;cilmente.</li>
    <li>Soporte para herramientas de enlace de datos que simplifican la gesti&oacute;n de la interacci&oacute;n de la
        interfaz de usuario con la l&oacute;gica de la aplicaci&oacute;n y el modelo de datos.</li>
    <li>Integraci&oacute;n nativa con otros frameworks y tecnolog&iacute;as de Java como JSP, EJB (Enterprise
        JavaBeans), y CDI (Context and Dependency Injection).</li>
    <li>Permite la navegaci&oacute;n controlada a trav&eacute;s de "faces-config.xml", un archivo de
        configuraci&oacute;n XML que define las reglas de navegaci&oacute;n de la aplicaci&oacute;n.</li>
    <li>Facilita la creaci&oacute;n de interfaces de usuario avanzadas con soporte para AJAX a trav&eacute;s de
        bibliotecas como PrimeFaces, RichFaces y otros.</li>
</ul>
<p>- Usos comunes:</p>
<ul>
    <li>Creaci&oacute;n de aplicaciones web Java que necesitan interfaces de usuario complejas y basadas en componentes.
    </li>
    <li>Desarrollo de aplicaciones empresariales grandes con una separaci&oacute;n clara entre la l&oacute;gica de
        negocio y la capa de presentaci&oacute;n.</li>
    <li>Integraci&oacute;n con otras tecnolog&iacute;as de Java para el desarrollo de aplicaciones web robustas.</li>
</ul>
<h3>3. JavaScript</h3>
<p>- Definici&oacute;n: JavaScript es un lenguaje de programaci&oacute;n interpretado que se ejecuta del lado del
    cliente (aunque tambi&eacute;n puede ejecutarse en el servidor con tecnolog&iacute;as como Node.js). Es uno de los
    lenguajes m&aacute;s importantes para el desarrollo web moderno.</p>
<p>- Caracter&iacute;sticas:</p>
<ul>
    <li>Lenguaje de scripting orientado a objetos, din&aacute;mico y d&eacute;bilmente tipado.</li>
    <li>Permite la manipulaci&oacute;n del DOM (Document Object Model), lo que permite a los desarrolladores crear
        p&aacute;ginas web interactivas y din&aacute;micas.</li>
    <li>Soporte para Ajax (Asynchronous JavaScript and XML), lo que permite la comunicaci&oacute;n as&iacute;ncrona con
        el servidor sin recargar la p&aacute;gina.</li>
    <li>Amplio soporte para bibliotecas y frameworks como jQuery, React, Angular, Vue.js, que facilitan el desarrollo de
        aplicaciones web y SPA (Single Page Applications).</li>
    <li>Capacidad de manejar eventos, validaciones de formularios, animaciones, y mucho m&aacute;s.</li>
</ul>
<p>- Usos comunes:</p>
<ul>
    <li>Creaci&oacute;n de aplicaciones web interactivas y din&aacute;micas.</li>
    <li>Manipulaci&oacute;n de la interfaz de usuario en tiempo real sin necesidad de recargar la p&aacute;gina.</li>
    <li>Desarrollo del lado del servidor utilizando Node.js, creando aplicaciones de backend r&aacute;pidas y
        escalables.</li>
    <li>Integraci&oacute;n con APIs y servicios externos para enriquecer la funcionalidad de las aplicaciones web.</li>
</ul>
<h3>&iquest;C&oacute;mo trabajan juntos JSP, JSF y JavaScript?</h3>
<p>JSP y JSF se utilizan principalmente en el lado del servidor para crear contenido din&aacute;mico y manejar la
    l&oacute;gica de negocio.</p>
<p>JavaScript se ejecuta en el lado del cliente (navegador) y se utiliza para manipular el DOM, manejar eventos de
    usuario y realizar tareas as&iacute;ncronas.</p>
<p>En aplicaciones Java basadas en la web, JSF puede generar vistas que utilizan JavaScript para manejar la
    interactividad del lado del cliente. Adem&aacute;s, JSP puede incluir scripts de JavaScript para combinar la
    l&oacute;gica del lado del servidor con la interactividad del lado del cliente.</p>
<p>En resumen, JSP, JSF y JavaScript son tecnolog&iacute;as clave para el desarrollo de aplicaciones web, cada una
    aportando su propio conjunto de caracter&iacute;sticas y capacidades para crear aplicaciones ricas y
    din&aacute;micas.</p>
<h2>35.3. Usabilidad y Accesibilidad Web.</h2>
<p>La usabilidad y la accesibilidad web son dos conceptos fundamentales en el desarrollo y dise&ntilde;o de sitios y
    aplicaciones web. Ambas son esenciales para crear experiencias web inclusivas, eficientes y efectivas para todos los
    usuarios, independientemente de sus habilidades o limitaciones.</p>
<h3>1. Usabilidad Web</h3>
<p>- Definici&oacute;n: La usabilidad web se refiere a la facilidad con la que los usuarios pueden navegar y utilizar un
    sitio web. En pocas palabras, es la capacidad de un sitio web para satisfacer las necesidades de sus usuarios de
    manera eficiente, efectiva y satisfactoria.</p>
<h4>Principios clave de la usabilidad:</h4>
<p>- Facilidad de Aprendizaje: Un sitio web debe ser f&aacute;cil de aprender a usar para que los nuevos visitantes
    puedan encontrar lo que buscan sin dificultad.</p>
<p>- Eficiencia de Uso: Una vez que los usuarios han aprendido a usar el sitio, deben ser capaces de llevar a cabo sus
    tareas de manera r&aacute;pida.</p>
<p>- Memorabilidad: Cuando los usuarios regresan al sitio despu&eacute;s de un tiempo sin usarlo, deben ser capaces de
    recordar c&oacute;mo usarlo con facilidad.</p>
<p>- Prevenci&oacute;n de Errores: El dise&ntilde;o debe ayudar a los usuarios a evitar errores y, si ocurren, debe
    proporcionar instrucciones claras para resolverlos.</p>
<p>- Satisfacci&oacute;n del Usuario: Los usuarios deben sentirse satisfechos con su experiencia, encontrando la
    interfaz agradable y &uacute;til.</p>
<h4>Pr&aacute;cticas recomendadas:</h4>
<p>- Dise&ntilde;o de Navegaci&oacute;n Claro: Usar men&uacute;s de navegaci&oacute;n simples y consistentes para que
    los usuarios puedan moverse f&aacute;cilmente por el sitio.</p>
<p>- Consistencia: Mantener un dise&ntilde;o y una estructura consistentes en todas las p&aacute;ginas del sitio para
    que los usuarios se familiaricen r&aacute;pidamente con &eacute;l.</p>
<p>- Contenido F&aacute;cil de Escanear: Usar encabezados, listas y p&aacute;rrafos cortos para que el contenido sea
    f&aacute;cil de leer y escanear.</p>
<p>- Dise&ntilde;o Responsivo: Adaptar el dise&ntilde;o de la web para que sea accesible y usable en diferentes
    dispositivos (m&oacute;viles, tabletas, escritorios).</p>
<h3>2. Accesibilidad Web</h3>
<p>- Definici&oacute;n: La accesibilidad web se refiere a la pr&aacute;ctica de hacer que los sitios y aplicaciones web
    sean utilizables por todas las personas, independientemente de sus discapacidades (f&iacute;sicas, auditivas,
    visuales, cognitivas, etc.). Esto significa que las personas con discapacidades deben poder percibir, entender,
    navegar e interactuar con la web de manera efectiva.</p>
<h4>Principios clave de la accesibilidad (seg&uacute;n las Pautas de Accesibilidad para el Contenido Web - WCAG):</h4>
<p>Perceptible: La informaci&oacute;n y los componentes de la interfaz de usuario deben ser presentados de manera que
    puedan ser percibidos por todos los usuarios. Ejemplos:</p>
<p>Texto alternativo para im&aacute;genes (atributo alt en HTML).<br /> Subt&iacute;tulos para contenido
    multimedia.<br /> <br /> Operable: Los componentes de la interfaz de usuario y la navegaci&oacute;n deben ser
    operables. Ejemplos:</p>
<p>Navegaci&oacute;n accesible mediante teclado para personas que no pueden usar un rat&oacute;n.<br /> Evitar contenido
    que parpadea r&aacute;pidamente para prevenir ataques epil&eacute;pticos.</p>
<p>Comprensible: La informaci&oacute;n y la operaci&oacute;n de la interfaz de usuario deben ser comprensibles.
    Ejemplos:</p>
<p>Uso de un lenguaje claro y sencillo.<br /> Consistencia en la navegaci&oacute;n y el dise&ntilde;o de la interfaz.
</p>
<p>Robusto: El contenido debe ser lo suficientemente robusto como para ser interpretado de manera fiable por una amplia
    variedad de agentes de usuario, incluidos los dispositivos de asistencia. Ejemplos:</p>
<p>Uso de est&aacute;ndares web correctos para garantizar la compatibilidad con lectores de pantalla.</p>
<h4>Pr&aacute;cticas recomendadas:</h4>
<p>Uso de Etiquetas Aria (Accessible Rich Internet Applications): Para proporcionar informaci&oacute;n adicional a los
    usuarios de tecnolog&iacute;as asistivas.</p>
<p>Contraste de Colores Adecuado: Asegurarse de que haya suficiente contraste entre el texto y el fondo para que el
    contenido sea legible para personas con discapacidades visuales.</p>
<p>Dise&ntilde;o Responsivo e Inclusivo: Crear sitios que sean utilizables en una amplia gama de dispositivos y
    configuraciones de hardware/software.</p>
<p>Formularios Accesibles: Proporcionar etiquetas y descripciones claras para todos los campos del formulario para que
    los usuarios sepan exactamente qu&eacute; informaci&oacute;n se requiere.</p>
<p>Diferencia entre Usabilidad y Accesibilidad</p>
<p>Usabilidad se centra en la experiencia general del usuario y en c&oacute;mo de f&aacute;cil y eficiente es para ellos
    usar el sitio web.</p>
<p>Accesibilidad, por otro lado, se centra en asegurar que el sitio web sea utilizable por personas con discapacidades,
    garantizando que todos tengan igual acceso a la informaci&oacute;n y las funcionalidades del sitio.</p>
<h3>&iquest;Por qu&eacute; son importantes la Usabilidad y la Accesibilidad?</h3>
<p>Experiencia de Usuario Mejorada: Una buena usabilidad y accesibilidad crean una experiencia positiva para todos los
    usuarios, lo que puede aumentar la retenci&oacute;n, la satisfacci&oacute;n y la lealtad del usuario.</p>
<p>Cumplimiento Legal: En muchos pa&iacute;ses, la accesibilidad web es un requisito legal para sitios web
    p&uacute;blicos, gubernamentales e incluso comerciales. Incumplir con estos est&aacute;ndares puede resultar en
    demandas o sanciones.</p>
<p>Ampliaci&oacute;n del P&uacute;blico Objetivo: La accesibilidad web permite que m&aacute;s personas, incluidas
    aquellas con discapacidades, accedan y utilicen sitios y aplicaciones web, ampliando as&iacute; el alcance potencial
    de un sitio web.</p>
<p>En resumen, la usabilidad y la accesibilidad web son esenciales para garantizar que los sitios web sean inclusivos,
    eficientes y efectivos para todos los usuarios, mejorando tanto la experiencia del usuario como el cumplimiento con
    las normativas legales.</p>