<h1>Tema 36. Arquitecturas orientadas a servicios SOA I.</h1>
<h2>36.1. Caracter&iacute;sticas y componentes.</h2>
<p>Las arquitecturas orientadas a servicios (SOA, por sus siglas en ingl&eacute;s) son un enfoque de dise&ntilde;o de
    software en el que las aplicaciones se estructuran como un conjunto de servicios independientes que
    interact&uacute;an entre s&iacute;. Este enfoque permite que los sistemas sean m&aacute;s flexibles, escalables y
    mantenibles. A continuaci&oacute;n se detallan las caracter&iacute;sticas y componentes principales de SOA:</p>
<h3>Caracter&iacute;sticas de SOA:</h3>
<ul>
    <li>Modularidad y Reusabilidad: SOA permite que las aplicaciones se construyan a partir de servicios modulares que
        se pueden reutilizar en diferentes aplicaciones o contextos.</li>
    <li>Interoperabilidad: Los servicios en SOA se comunican a trav&eacute;s de interfaces estandarizadas (como XML,
        JSON, SOAP, REST), lo que permite que sistemas heterog&eacute;neos interact&uacute;en sin problemas.</li>
    <li>Desacoplamiento: Los servicios est&aacute;n dise&ntilde;ados para ser independientes entre s&iacute;. Este
        desacoplamiento facilita la modificaci&oacute;n, actualizaci&oacute;n o reemplazo de servicios individuales sin
        afectar a los dem&aacute;s.</li>
    <li>Orientaci&oacute;n a contratos: Cada servicio expone una interfaz p&uacute;blica que define un contrato,
        especificando c&oacute;mo interactuar con &eacute;l. Este contrato incluye detalles sobre los m&eacute;todos
        disponibles, los par&aacute;metros que se pueden pasar, y las respuestas que se pueden esperar.</li>
    <li>Composici&oacute;n de Servicios: Los servicios en SOA pueden ser combinados para crear aplicaciones o servicios
        m&aacute;s complejos, lo que se conoce como orquestaci&oacute;n o coreograf&iacute;a de servicios.</li>
    <li>Independencia de Plataforma: Los servicios en SOA pueden ser implementados en diferentes lenguajes de
        programaci&oacute;n y ejecutarse en distintas plataformas, siempre que se adhieran a los est&aacute;ndares de
        comunicaci&oacute;n acordados.</li>
    <li>Governanza y Seguridad: SOA incluye pol&iacute;ticas y est&aacute;ndares para asegurar la calidad, seguridad,
        monitoreo y manejo de excepciones de los servicios.</li>
    <li>Escalabilidad y Flexibilidad: Debido a su naturaleza modular, SOA permite que las aplicaciones escalen
        f&aacute;cilmente y se adapten a nuevos requisitos.</li>
</ul>
<h3>Componentes de SOA:</h3>
<ul>
    <li>Servicios: Son las unidades b&aacute;sicas de funcionalidad en SOA. Los servicios pueden ser de diferentes
        tipos, como:</li>
    <li>Servicios de Negocio: Ofrecen funciones de negocio espec&iacute;ficas, como el procesamiento de pedidos o la
        gesti&oacute;n de inventarios.</li>
    <li>Servicios de Utilidad: Servicios generales que pueden ser utilizados por m&uacute;ltiples servicios de negocio,
        como servicios de autenticaci&oacute;n o de encriptaci&oacute;n.</li>
    <li>Servicios de Entidades: Servicios que se encargan de manipular y gestionar datos.</li>
    <li>Contrato de Servicio: Define la interfaz del servicio, incluyendo las operaciones disponibles, los
        par&aacute;metros necesarios y los tipos de datos utilizados. Se representa generalmente en lenguajes como WSDL
        (Web Services Description Language).</li>
    <li>Bus de Servicios Empresariales (Enterprise Service Bus - ESB): Es un componente intermedio que facilita la
        comunicaci&oacute;n entre servicios. El ESB proporciona capacidades como la transformaci&oacute;n de mensajes,
        el enrutamiento din&aacute;mico, la mediaci&oacute;n y la gesti&oacute;n de errores.</li>
    <li>Registro de Servicios (Service Registry): Es un directorio centralizado donde se publican y se descubren los
        servicios disponibles en la arquitectura. Los registros m&aacute;s comunes utilizan UDDI (Universal Description,
        Discovery, and Integration) para este prop&oacute;sito.</li>
    <li>Orquestaci&oacute;n de Servicios: Se refiere a la combinaci&oacute;n de servicios m&uacute;ltiples para
        construir procesos de negocio m&aacute;s complejos. Esto a menudo se implementa mediante un motor de
        orquestaci&oacute;n que sigue lenguajes de modelado de procesos como BPEL (Business Process Execution Language).
    </li>
    <li>Mediadores de Servicios (Service Mediators): Incluyen adaptadores, transformadores de mensajes y otros
        componentes que permiten la interoperabilidad y compatibilidad entre servicios de diferentes sistemas o
        tecnolog&iacute;as.</li>
    <li>Pol&iacute;tica de Seguridad: Implementa controles de acceso, autenticaci&oacute;n, autorizaci&oacute;n, cifrado
        y otros mecanismos para proteger los servicios y los datos que manejan.</li>
    <li>Monitoreo y Gesti&oacute;n de Servicios: Incluye herramientas y componentes para monitorear el rendimiento, la
        disponibilidad y el uso de los servicios. Tambi&eacute;n se utiliza para detectar y gestionar problemas o
        excepciones.</li>
    <li>Clientes de Servicios: Son las aplicaciones o componentes que consumen los servicios expuestos en la
        arquitectura SOA. Pueden ser aplicaciones de usuario final, otros servicios o sistemas externos.</li>
</ul>
<h3>Beneficios de SOA:</h3>
<ul>
    <li>Mejora de la Flexibilidad y la Agilidad del Negocio: Permite responder r&aacute;pidamente a los cambios del
        mercado al permitir la reutilizaci&oacute;n y la reconfiguraci&oacute;n de servicios.</li>
    <li>Reducci&oacute;n de Costos: A trav&eacute;s de la reutilizaci&oacute;n de servicios existentes y la
        simplificaci&oacute;n de la integraci&oacute;n entre sistemas heterog&eacute;neos.</li>
    <li>Mejora de la Mantenibilidad: El desacoplamiento facilita la actualizaci&oacute;n, el mantenimiento y la prueba
        de componentes individuales.</li>
</ul>
<h3>Desaf&iacute;os de SOA:</h3>
<ul>
    <li>Complejidad en la Implementaci&oacute;n: Requiere una cuidadosa planificaci&oacute;n y un dise&ntilde;o de
        arquitectura detallado.</li>
    <li>Requisitos de Gobernanza y Gesti&oacute;n: Es fundamental establecer pol&iacute;ticas de gobernanza robustas
        para gestionar el ciclo de vida de los servicios, la seguridad y el cumplimiento.</li>
    <li>Sobrecarga de Rendimiento: La comunicaci&oacute;n entre servicios puede a&ntilde;adir una sobrecarga que afecte
        al rendimiento, especialmente si no se gestiona correctamente.</li>
    <li>En resumen, SOA es una arquitectura poderosa para organizaciones que buscan construir aplicaciones modulares,
        reutilizables y escalables. Sin embargo, requiere un enfoque bien gestionado para manejar su complejidad y
        asegurar el &eacute;xito de su implementaci&oacute;n.</li>
</ul>
<h2>36.2. Arquitectura.</h2>
<p>La Arquitectura Orientada a Servicios (SOA, por sus siglas en ingl&eacute;s) es un enfoque de dise&ntilde;o de
    software que permite construir aplicaciones componi&eacute;ndolas a partir de servicios independientes. En una
    arquitectura SOA, los servicios son piezas de software que est&aacute;n dise&ntilde;adas para ser modulares,
    reutilizables, y capaces de interactuar entre s&iacute; a trav&eacute;s de una red, generalmente utilizando
    protocolos est&aacute;ndar. SOA es ampliamente utilizada para mejorar la interoperabilidad entre sistemas
    heterog&eacute;neos y fomentar la flexibilidad y escalabilidad en el desarrollo de software.</p>
<h3>Principios Fundamentales de SOA:</h3>
<p>- Interoperabilidad: Los servicios pueden comunicarse a trav&eacute;s de est&aacute;ndares abiertos y protocolos
    comunes como HTTP, XML, JSON, SOAP y REST, lo que permite la interoperabilidad entre diferentes plataformas y
    tecnolog&iacute;as.</p>
<p>- Reusabilidad: Los servicios en SOA est&aacute;n dise&ntilde;ados para ser reutilizables en diferentes aplicaciones
    y contextos. Una vez que un servicio se crea, puede ser consumido por m&uacute;ltiples clientes.</p>
<p>- Desacoplamiento: Los servicios son componentes aut&oacute;nomos que tienen un conocimiento m&iacute;nimo sobre
    otros servicios. Esto significa que un servicio puede ser modificado, reemplazado o actualizado sin afectar a otros
    servicios que interact&uacute;an con &eacute;l.</p>
<p>- Modularidad: SOA promueve la creaci&oacute;n de servicios modulares, lo que permite que los desarrolladores los
    combinen o descompongan seg&uacute;n sea necesario para cumplir con los requisitos de negocio.</p>
<p>- Orientaci&oacute;n a Contratos: Cada servicio expone un contrato que define c&oacute;mo interactuar con &eacute;l,
    especificando las operaciones disponibles, los par&aacute;metros que acepta, y los tipos de datos que maneja.</p>
<p>- Composici&oacute;n: Los servicios pueden ser combinados o compuestos para crear aplicaciones m&aacute;s complejas o
    procesos de negocio que requieran flujos de trabajo espec&iacute;ficos.</p>
<p>- Governanza: SOA requiere una gesti&oacute;n adecuada y pol&iacute;ticas claras para la creaci&oacute;n,
    publicaci&oacute;n, descubrimiento, mantenimiento, y retiro de los servicios.</p>
<h3>Componentes Clave de SOA:</h3>
<p>- Servicios: Son las unidades b&aacute;sicas de una arquitectura SOA. Los servicios pueden clasificarse en:</p>
<p>* Servicios de Negocio: Realizan funciones espec&iacute;ficas de negocio.<br /> * Servicios de Utilidad: Realizan
    funciones comunes como la autenticaci&oacute;n, el registro o la auditor&iacute;a.<br /> * Servicios de Proceso:
    Orquestan servicios de negocio para realizar procesos de negocio m&aacute;s complejos.<br /> <br /> - Contrato de
    Servicio: Un contrato de servicio define las interfaces de servicio, las operaciones que ofrece, los tipos de datos
    que maneja y otros detalles necesarios para su consumo.</p>
<p>- Bus de Servicios Empresariales (ESB): El ESB es un componente fundamental en SOA que act&uacute;a como middleware
    para conectar servicios. Facilita la comunicaci&oacute;n entre servicios a trav&eacute;s de mediaci&oacute;n,
    enrutamiento, transformaci&oacute;n de datos y gesti&oacute;n de protocolos.</p>
<p>- Registro de Servicios (Service Registry): Es un repositorio donde se almacenan los metadatos de los servicios
    disponibles, permitiendo que otros servicios o aplicaciones los descubran y los consuman.</p>
<p>- Orquestaci&oacute;n y Coreograf&iacute;a de Servicios: La orquestaci&oacute;n se refiere a la creaci&oacute;n de
    flujos de trabajo que coordinan la ejecuci&oacute;n de m&uacute;ltiples servicios, mientras que la
    coreograf&iacute;a describe c&oacute;mo los servicios interact&uacute;an de forma colaborativa sin un controlador
    central.</p>
<p>- Cliente de Servicios: Es la entidad que consume los servicios publicados. Puede ser otra aplicaci&oacute;n, un
    usuario final o un servicio externo.</p>
<p>- Monitoreo y Gesti&oacute;n de Servicios: Los sistemas SOA requieren herramientas para monitorear el rendimiento, la
    disponibilidad y el uso de los servicios, as&iacute; como para gestionar problemas y excepciones.</p>
<h3>Beneficios de la Arquitectura SOA:</h3>
<p>Flexibilidad y Adaptabilidad: SOA permite a las organizaciones responder r&aacute;pidamente a los cambios en los
    requisitos del negocio, permitiendo la r&aacute;pida composici&oacute;n y recomposici&oacute;n de servicios.</p>
<p>Reutilizaci&oacute;n de Componentes: Al promover la reutilizaci&oacute;n de servicios, se reduce la
    duplicaci&oacute;n de esfuerzos y se optimizan los costos de desarrollo.</p>
<p>Mejora en la Integraci&oacute;n de Sistemas: SOA facilita la integraci&oacute;n de sistemas heterog&eacute;neos,
    permitiendo que diferentes aplicaciones se comuniquen e intercambien datos f&aacute;cilmente.</p>
<p>Escalabilidad: La naturaleza modular de SOA permite que las aplicaciones escalen horizontalmente al agregar nuevos
    servicios o instancias de servicios seg&uacute;n sea necesario.</p>
<p>Facilidad de Mantenimiento: Debido al desacoplamiento de servicios, es m&aacute;s f&aacute;cil mantener, actualizar o
    reemplazar componentes sin afectar al sistema completo.</p>
<p>Desaf&iacute;os de la Arquitectura SOA:</p>
<p>Complejidad: La implementaci&oacute;n de SOA puede ser compleja debido a la necesidad de dise&ntilde;ar servicios
    bien definidos, establecer pol&iacute;ticas de gobernanza, y asegurar una gesti&oacute;n adecuada del ciclo de vida
    de los servicios.</p>
<p>Sobrecarga de Rendimiento: La comunicaci&oacute;n entre servicios a trav&eacute;s de la red puede introducir
    latencias y sobrecarga, especialmente si los servicios no est&aacute;n optimizados.</p>
<p>Governanza y Gesti&oacute;n de Servicios: Requiere una fuerte gobernanza para gestionar efectivamente el registro, la
    versi&oacute;n, la seguridad y la calidad del servicio.</p>
<p>Costos de Implementaci&oacute;n Iniciales: La adopci&oacute;n de SOA puede tener altos costos iniciales debido a la
    inversi&oacute;n en infraestructura (como ESB), herramientas de gesti&oacute;n, y formaci&oacute;n del personal.</p>
<h3>Ejemplos de Uso de SOA:</h3>
<p>SOA se utiliza ampliamente en diversos sectores como la banca, telecomunicaciones, salud y comercio
    electr&oacute;nico. Algunos ejemplos espec&iacute;ficos incluyen:</p>
<p>- Banca y Finanzas: Integraci&oacute;n de diferentes sistemas bancarios, como sistemas de gesti&oacute;n de cuentas,
    pagos, y servicios de atenci&oacute;n al cliente, a trav&eacute;s de servicios compartidos.</p>
<p>- Telecomunicaciones: Provisi&oacute;n de servicios como facturaci&oacute;n, gesti&oacute;n de clientes, y servicios
    de red a trav&eacute;s de una arquitectura orientada a servicios.</p>
<p>- Salud: Integraci&oacute;n de diferentes sistemas de informaci&oacute;n cl&iacute;nica, como registros
    m&eacute;dicos electr&oacute;nicos (EMR), sistemas de gesti&oacute;n de hospitales, y sistemas de seguros.</p>
<h3>Conclusi&oacute;n</h3>
<p>SOA sigue siendo una arquitectura poderosa para el desarrollo de aplicaciones en entornos empresariales complejos,
    especialmente cuando se necesita flexibilidad, integraci&oacute;n y escalabilidad. Aunque tiene desaf&iacute;os en
    t&eacute;rminos de complejidad y gobernanza, cuando se implementa correctamente, SOA puede ofrecer beneficios
    significativos en t&eacute;rminos de reutilizaci&oacute;n, integraci&oacute;n y capacidad de respuesta a los cambios
    del negocio.</p>
<h2>36.3. Comparativa y ventajas frente a otras arquitecturas.</h2>
<h3>1. SOA (Arquitectura Orientada a Servicios) vs. Microservicios</h3>
<p>- SOA:</p>
<p>Enfoque: Integra aplicaciones empresariales utilizando servicios distribuidos, com&uacute;nmente a trav&eacute;s de
    un Bus de Servicios Empresariales (ESB).</p>
<p>Granularidad: Los servicios tienden a ser m&aacute;s gruesos y abarcan un conjunto de funcionalidades de negocio
    relacionadas.</p>
<p>Comunicaci&oacute;n: Basada en protocolos est&aacute;ndar como SOAP, WSDL y XML, aunque tambi&eacute;n puede utilizar
    REST.</p>
<p>Gobernanza: Requiere una fuerte gobernanza centralizada para el control de servicios y la gesti&oacute;n de
    pol&iacute;ticas de seguridad, versionado y monitoreo.</p>
<p>Escalabilidad: Puede ser escalada, pero depende de la infraestructura del ESB que, en algunos casos, puede ser un
    cuello de botella.</p>
<p>- Microservicios:</p>
<p>Enfoque: Divide las aplicaciones en servicios muy peque&ntilde;os y aut&oacute;nomos que pueden desplegarse y
    gestionarse de forma independiente.</p>
<p>Granularidad: Los servicios son m&aacute;s peque&ntilde;os y est&aacute;n dise&ntilde;ados para cumplir con una
    &uacute;nica responsabilidad.</p>
<p>Comunicaci&oacute;n: Utiliza principalmente APIs RESTful y mensajer&iacute;a ligera (como JSON sobre HTTP), lo que
    permite una comunicaci&oacute;n m&aacute;s &aacute;gil.</p>
<p>Gobernanza: Cada equipo tiene control sobre sus microservicios, lo que reduce la necesidad de gobernanza
    centralizada, pero requiere mecanismos de automatizaci&oacute;n y monitoreo distribuidos.</p>
<p>Escalabilidad: Alta escalabilidad; los microservicios se pueden desplegar y escalar de forma independiente.</p>
<h3>Ventajas de SOA frente a Microservicios:</h3>
<p>Reutilizaci&oacute;n de Servicios: SOA facilita la reutilizaci&oacute;n de servicios m&aacute;s grandes y robustos,
    lo que es ideal para organizaciones que necesitan una integraci&oacute;n profunda entre sistemas complejos.</p>
<p>Gesti&oacute;n Centralizada: La gobernanza centralizada puede ser ventajosa para organizaciones que requieren un alto
    control sobre pol&iacute;ticas de seguridad, cumplimiento y auditor&iacute;a.</p>
<p>Integraci&oacute;n de Sistemas Legados: SOA es m&aacute;s adecuada para integrar sistemas empresariales heredados
    (legacy systems) que ya existen y dependen de protocolos est&aacute;ndar como SOAP.</p>
<h3>2. SOA vs. Arquitectura Monol&iacute;tica</h3>
<p>- SOA:</p>
<p>Modularidad: Los servicios son modulares y desacoplados, lo que facilita la actualizaci&oacute;n, el mantenimiento y
    la escalabilidad de partes espec&iacute;ficas del sistema.</p>
<p>Flexibilidad y Agilidad: Permite a las organizaciones componer servicios para adaptar r&aacute;pidamente las
    aplicaciones a los cambios del negocio.</p>
<p>Despliegue Independiente: Los servicios pueden ser desplegados y gestionados de forma independiente, reduciendo el
    tiempo de inactividad durante las actualizaciones.</p>
<p>- Arquitectura Monol&iacute;tica:</p>
<p>Modularidad: Todo el c&oacute;digo est&aacute; empaquetado en una &uacute;nica aplicaci&oacute;n o servicio, lo que
    puede hacer que sea dif&iacute;cil modificar o actualizar partes del sistema sin afectar a todo el sistema.</p>
<p>Despliegue: El despliegue implica una &uacute;nica unidad; cualquier cambio requiere que toda la aplicaci&oacute;n se
    vuelva a desplegar.</p>
<p>Escalabilidad: La escalabilidad es m&aacute;s dif&iacute;cil y a menudo se limita a la escalabilidad vertical
    (a&ntilde;adir m&aacute;s recursos a un &uacute;nico servidor).</p>
<h3>Ventajas de SOA frente a la Arquitectura Monol&iacute;tica:</h3>
<p>Escalabilidad y Mantenimiento: SOA permite la escalabilidad horizontal y facilita el mantenimiento, ya que los
    servicios individuales pueden ser modificados o escalados sin interrumpir toda la aplicaci&oacute;n.</p>
<p>Integraci&oacute;n con Sistemas Externos: SOA es m&aacute;s adecuada para integrar m&uacute;ltiples sistemas y
    servicios de terceros, lo que no es factible en un sistema monol&iacute;tico.</p>
<p>Actualizaciones y Despliegue Continuo: Permite un despliegue continuo sin afectar a toda la aplicaci&oacute;n,
    reduciendo los riesgos de cambios y el tiempo de inactividad.</p>
<h3>3. SOA vs. Arquitectura de Servicios Web (WSA)</h3>
<p>- SOA:</p>
<p>Filosof&iacute;a de Dise&ntilde;o: Es una filosof&iacute;a arquitect&oacute;nica que abarca principios como el
    desacoplamiento, la interoperabilidad y la reutilizaci&oacute;n de servicios en toda la empresa.</p>
<p>Tecnolog&iacute;as Utilizadas: Aunque SOA suele utilizar servicios web como tecnolog&iacute;a de
    implementaci&oacute;n, tambi&eacute;n puede utilizar otras tecnolog&iacute;as y protocolos (SOAP, REST, JMS, etc.).
</p>
<p>Escalabilidad y Flexibilidad: Ofrece una arquitectura m&aacute;s flexible y robusta para integrar y gestionar
    servicios a nivel empresarial.</p>
<p>- Arquitectura de Servicios Web (WSA):</p>
<p>Filosof&iacute;a de Dise&ntilde;o: Es un enfoque m&aacute;s espec&iacute;fico que generalmente se centra en el uso de
    tecnolog&iacute;as basadas en servicios web (como SOAP, WSDL) para la comunicaci&oacute;n entre sistemas.</p>
<p>Despliegue: Los servicios web generalmente se despliegan en un entorno m&aacute;s est&aacute;tico y no proporcionan
    las capacidades de gobernanza y gesti&oacute;n que SOA ofrece.</p>
<p>Alcance: La arquitectura de servicios web se utiliza principalmente para integraci&oacute;n a peque&ntilde;a escala,
    mientras que SOA se usa para la integraci&oacute;n a nivel empresarial.</p>
<h3>- Ventajas de SOA frente a WSA:</h3>
<p>Mayor Flexibilidad y Alcance: SOA proporciona un marco m&aacute;s amplio y flexible para integrar servicios y
    aplicaciones empresariales en comparaci&oacute;n con la arquitectura de servicios web.</p>
<p>Capacidades de Governanza y Gesti&oacute;n: SOA incluye un enfoque m&aacute;s fuerte en gobernanza, gesti&oacute;n de
    pol&iacute;ticas, seguridad y monitoreo, que es fundamental para las aplicaciones empresariales grandes y complejas.
</p>
<p>Composici&oacute;n y Orquestaci&oacute;n de Servicios: SOA permite la creaci&oacute;n de procesos de negocio
    complejos mediante la orquestaci&oacute;n de m&uacute;ltiples servicios, lo que no es una caracter&iacute;stica
    predominante en WSA.</p>
<p>Resumen de Ventajas de SOA frente a Otras Arquitecturas:</p>
<p>Interoperabilidad y Flexibilidad: SOA es ideal para organizaciones que necesitan integrar diferentes aplicaciones y
    sistemas de diversas tecnolog&iacute;as, lo que facilita la interoperabilidad.</p>
<p>Reutilizaci&oacute;n y Modularidad: Facilita la reutilizaci&oacute;n de servicios a lo largo de la
    organizaci&oacute;n, reduciendo costos de desarrollo y tiempos de entrega.</p>
<p>Governanza y Seguridad Centralizada: Proporciona una estructura de gobernanza centralizada para la gesti&oacute;n de
    pol&iacute;ticas de seguridad, versionado y calidad del servicio.</p>
<p>Adecuada para Integraci&oacute;n de Sistemas Legados: Es particularmente ventajosa cuando se trata de integrar
    sistemas empresariales heredados o basados en tecnolog&iacute;as m&aacute;s antiguas.</p>
<p>Escalabilidad y Mantenibilidad: Permite una escalabilidad m&aacute;s granular y un mantenimiento m&aacute;s sencillo
    que las arquitecturas monol&iacute;ticas.</p>
<p>Soporte para Procesos de Negocio Complejos: Con capacidad de orquestaci&oacute;n y coreograf&iacute;a de servicios,
    SOA puede manejar procesos de negocio complejos que requieren la colaboraci&oacute;n de m&uacute;ltiples servicios.
</p>
<p>En resumen, SOA es una arquitectura poderosa para organizaciones grandes que necesitan una integraci&oacute;n
    profunda de sistemas y servicios, un control robusto de gobernanza y la capacidad de reaccionar r&aacute;pidamente a
    los cambios del negocio. Aunque otras arquitecturas, como microservicios, pueden ofrecer ventajas en t&eacute;rminos
    de agilidad y despliegue, SOA sigue siendo una opci&oacute;n preferida en escenarios empresariales m&aacute;s
    tradicionales y complejos.</p>