<h1>Tema 39. Proyectos de desarrollo de software.</h1>
<h2>39.1. DEVOPS Concepto, principios y beneficios.</h2>
<p>DevOps es una metodolog&iacute;a que combina desarrollo de software (Development) y operaciones de TI (Operations)
    con el objetivo de mejorar la colaboraci&oacute;n entre estos dos equipos, automatizar procesos, y entregar software
    de forma m&aacute;s r&aacute;pida, segura y confiable. DevOps no es solo una herramienta o un conjunto de
    pr&aacute;cticas; es una cultura y mentalidad que aboga por la integraci&oacute;n, la automatizaci&oacute;n, la
    colaboraci&oacute;n y la retroalimentaci&oacute;n continua.</p>
<h3>Concepto de DevOps</h3>
<p>El concepto de DevOps se centra en romper los silos tradicionales entre los equipos de desarrollo y operaciones,
    promoviendo una cultura de trabajo colaborativa. Esta integraci&oacute;n permite que los equipos puedan trabajar
    juntos durante todo el ciclo de vida del software, desde el desarrollo y las pruebas hasta el despliegue y las
    operaciones. DevOps busca optimizar y automatizar los procesos, reducir el tiempo de entrega de software y mejorar
    la calidad mediante pr&aacute;cticas de integraci&oacute;n y entrega continua.</p>
<h3>Principios de DevOps</h3>
<p><strong>Colaboraci&oacute;n y Comunicaci&oacute;n</strong>: Fomentar la comunicaci&oacute;n y la colaboraci&oacute;n
    entre los equipos de desarrollo y operaciones es fundamental. Los equipos deben trabajar en conjunto desde el inicio
    del proyecto hasta el final.</p>
<p><strong>Automatizaci&oacute;n</strong>: Automatizar tareas repetitivas como pruebas, integraci&oacute;n, despliegue y
    monitoreo es crucial para mejorar la eficiencia y reducir errores humanos.</p>
<p><strong>Integraci&oacute;n Continua (CI) y Entrega Continua (CD)</strong>: Estas pr&aacute;cticas implican la
    integraci&oacute;n frecuente de c&oacute;digo en un repositorio compartido y la automatizaci&oacute;n de las pruebas
    y el despliegue. El objetivo es permitir lanzamientos de software m&aacute;s r&aacute;pidos y seguros.</p>
<p><strong>Infraestructura como C&oacute;digo (IaC)</strong>: Utilizar c&oacute;digo para gestionar y aprovisionar
    infraestructuras, permitiendo la automatizaci&oacute;n de la configuraci&oacute;n y la escalabilidad de recursos de
    manera consistente.</p>
<p><strong>Monitoreo y Retroalimentaci&oacute;n Continua</strong>: Es esencial tener visibilidad sobre el rendimiento de
    las aplicaciones y la infraestructura. Un monitoreo constante permite identificar problemas r&aacute;pidamente y
    aplicar mejoras continuas.</p>
<p><strong>Cultura de Aprendizaje y Mejora Continua</strong>: Fomentar una cultura donde los errores se consideren
    oportunidades de aprendizaje y se incentive la mejora constante de procesos y herramientas.</p>
<h3>Beneficios de DevOps</h3>
<p><strong>Entrega R&aacute;pida y Frecuente de Software</strong>: La automatizaci&oacute;n y las pr&aacute;cticas de
    CI/CD permiten ciclos de entrega m&aacute;s cortos, lo que facilita una respuesta m&aacute;s r&aacute;pida a las
    necesidades del mercado y a las solicitudes de los clientes.</p>
<p><strong>Mayor Calidad y Confiabilidad</strong>: Al integrar pruebas autom&aacute;ticas y despliegues automatizados,
    se reduce la probabilidad de errores, mejorando la calidad del software y la confiabilidad de los lanzamientos.</p>
<p><strong>Mejora en la Colaboraci&oacute;n y la Eficiencia</strong>: DevOps elimina las barreras entre los equipos de
    desarrollo y operaciones, fomentando una colaboraci&oacute;n m&aacute;s estrecha y reduciendo los conflictos.</p>
<p><strong>Reducci&oacute;n de Costos y Riesgos</strong>: La automatizaci&oacute;n de procesos y la infraestructura como
    c&oacute;digo permiten un mejor control de costos y una reducci&oacute;n en los riesgos asociados con errores
    humanos.</p>
<p><strong>Escalabilidad y Flexibilidad</strong>: DevOps permite una infraestructura y aplicaciones m&aacute;s
    escalables y flexibles, que pueden adaptarse r&aacute;pidamente a cambios en el entorno o en las necesidades del
    negocio.</p>
<p><strong>Mayor Innovaci&oacute;n y Velocidad en el Mercado</strong>: Los ciclos de retroalimentaci&oacute;n m&aacute;s
    cortos permiten a los equipos experimentar y adoptar nuevas tecnolog&iacute;as y mejoras de manera m&aacute;s
    r&aacute;pida, llevando la innovaci&oacute;n al mercado m&aacute;s pronto.</p>
<p>En resumen, DevOps es una filosof&iacute;a que busca mejorar el ciclo de vida del desarrollo de software mediante la
    integraci&oacute;n, la automatizaci&oacute;n y la colaboraci&oacute;n continua. Implementar DevOps puede llevar a
    una entrega de software m&aacute;s eficiente, de mayor calidad y con un mejor alineamiento a las necesidades del
    negocio.</p>
<h2>39.2. DEVOPS Ciclo de vida de las aplicaciones.</h2>
<p>El ciclo de vida de las aplicaciones en DevOps es un proceso continuo que abarca todas las etapas desde la
    planificaci&oacute;n y desarrollo hasta la operaci&oacute;n y monitoreo de software. Este ciclo de vida se centra en
    la integraci&oacute;n, la automatizaci&oacute;n y la retroalimentaci&oacute;n continua para entregar software de
    alta calidad de manera r&aacute;pida y eficiente. A continuaci&oacute;n se describe cada etapa del ciclo de vida de
    las aplicaciones en</p>
<h3>Ciclo de Vida de las Aplicaciones en DevOps:</h3>
<p><strong>- Planificaci&oacute;n (Plan)</strong>:</p>
<p>En esta etapa, los equipos de desarrollo y operaciones colaboran para definir los requisitos, los objetivos del
    proyecto y los criterios de &eacute;xito.</p>
<p>Se utiliza una metodolog&iacute;a &aacute;gil (como Scrum o Kanban) para gestionar el backlog de tareas y priorizar
    las funcionalidades que se desarrollar&aacute;n.</p>
<p>Las herramientas comunes en esta etapa incluyen Jira, Trello, Azure Boards, entre otras.</p>
<p><strong>- Codificaci&oacute;n (Code)</strong>:</p>
<p>Los desarrolladores escriben el c&oacute;digo de la aplicaci&oacute;n seg&uacute;n los requisitos definidos en la
    etapa de planificaci&oacute;n.</p>
<p>Se utiliza control de versiones (como Git) para gestionar y mantener el c&oacute;digo fuente, facilitando la
    colaboraci&oacute;n entre desarrolladores y permitiendo trabajar en paralelo.</p>
<p>Las revisiones de c&oacute;digo (code reviews) y la integraci&oacute;n continua ayudan a mantener la calidad del
    c&oacute;digo.</p>
<p><strong>- Construcci&oacute;n (Build)</strong>:</p>
<p>Una vez que el c&oacute;digo est&aacute; escrito y revisado, se compila y se construye en un entorno de
    integraci&oacute;n continua (CI).</p>
<p>En esta etapa, las herramientas como Jenkins, GitLab CI/CD, CircleCI, y Azure DevOps Pipelines automatizan la
    construcci&oacute;n del software.</p>
<p>El objetivo es crear un artefacto (por ejemplo, un ejecutable, contenedor Docker, etc.) que pueda ser probado y
    desplegado.</p>
<p><strong>- Pruebas (Test)</strong>:</p>
<p>Se ejecutan pruebas automatizadas para garantizar la calidad del software, incluidas pruebas unitarias, de
    integraci&oacute;n, de seguridad, de rendimiento, y pruebas de aceptaci&oacute;n.</p>
<p>Las herramientas comunes incluyen Selenium, JUnit, TestNG, SonarQube, y muchas otras.<br />El objetivo es identificar
    y corregir errores antes de que lleguen a producci&oacute;n.</p>
<p><strong>- Integraci&oacute;n Continua y Entrega Continua (CI/CD) (Release)</strong>:</p>
<p>En DevOps, la integraci&oacute;n continua y la entrega continua son pr&aacute;cticas clave que permiten la
    implementaci&oacute;n autom&aacute;tica y constante de nuevas versiones del software.</p>
<p>Despu&eacute;s de que el c&oacute;digo pasa todas las pruebas, puede ser implementado autom&aacute;ticamente en
    entornos de desarrollo, pruebas y producci&oacute;n.</p>
<p>Herramientas como Jenkins, GitLab CI/CD, Travis CI, y Azure DevOps Pipelines facilitan este proceso.</p>
<p><strong>- Despliegue (Deploy)</strong>:</p>
<p>Una vez que una versi&oacute;n es aprobada, se despliega en un entorno de producci&oacute;n. Este despliegue debe ser
    automatizado, confiable y r&aacute;pido.</p>
<p>Las herramientas de gesti&oacute;n de contenedores como Kubernetes y Docker, y las plataformas de nube como AWS,
    Azure, y Google Cloud son ampliamente utilizadas para automatizar y orquestar los despliegues.</p>
<p>Se pueden utilizar t&eacute;cnicas de despliegue como "blue-green deployment", "canary releases" y "rolling updates"
    para minimizar el tiempo de inactividad y reducir riesgos.</p>
<p><strong>- Operaci&oacute;n (Operate)</strong>:</p>
<p>En esta fase, la aplicaci&oacute;n est&aacute; en funcionamiento en el entorno de producci&oacute;n. El equipo de
    operaciones gestiona la infraestructura, supervisa el rendimiento y se asegura de que la aplicaci&oacute;n
    est&eacute; disponible y funcione de manera &oacute;ptima.</p>
<p>Herramientas de monitoreo como Prometheus, Grafana, Datadog, New Relic y ELK Stack (Elasticsearch, Logstash, Kibana)
    se utilizan para recopilar m&eacute;tricas, logs y datos de rendimiento.</p>
<p><strong>- Monitoreo y Retroalimentaci&oacute;n Continua (Monitor)</strong>:</p>
<p>Se realiza un monitoreo constante de la aplicaci&oacute;n para detectar problemas, errores o anomal&iacute;as en
    tiempo real. Esto permite a los equipos reaccionar r&aacute;pidamente ante cualquier incidente.</p>
<p>El monitoreo no solo se centra en la infraestructura, sino tambi&eacute;n en la experiencia del usuario final
    (observabilidad).</p>
<p>La retroalimentaci&oacute;n de los usuarios y los equipos internos se recopila para mejorar continuamente el
    producto.</p>
<p><strong>- Mejora Continua (Continuous Improvement)</strong>:</p>
<p>DevOps es un ciclo continuo, lo que significa que despu&eacute;s de la fase de monitoreo, los equipos utilizan los
    datos recopilados para identificar &aacute;reas de mejora.</p>
<p>Esta informaci&oacute;n se retroalimenta en la fase de planificaci&oacute;n para optimizar tanto el proceso de
    desarrollo como la operaci&oacute;n de la aplicaci&oacute;n.</p>
<h3>Resumen</h3>
<p>El ciclo de vida de las aplicaciones en DevOps es un proceso iterativo que integra las etapas de desarrollo, prueba,
    despliegue, operaci&oacute;n y monitoreo de manera continua. El objetivo es garantizar entregas de software
    m&aacute;s r&aacute;pidas, de alta calidad y alineadas con las necesidades del negocio, fomentando una cultura de
    colaboraci&oacute;n, automatizaci&oacute;n y mejora continua.</p>
<p>Este enfoque reduce el riesgo, mejora la calidad del software, permite una r&aacute;pida adaptaci&oacute;n a las
    necesidades del mercado y fomenta la innovaci&oacute;n.</p>
<h2>39.3. Integraci&oacute;n continua y despliegue continuo (CICD).</h2>
<p>Integraci&oacute;n Continua (Continuous Integration, CI) y Despliegue Continuo (Continuous Deployment, CD) son
    pr&aacute;cticas clave dentro del enfoque DevOps que permiten a los equipos de desarrollo y operaciones entregar
    software de alta calidad de manera r&aacute;pida, segura y frecuente. Estas pr&aacute;cticas se centran en la
    automatizaci&oacute;n de la construcci&oacute;n, pruebas y despliegue del software, lo que mejora la
    colaboraci&oacute;n entre equipos y reduce el tiempo de entrega.</p>
<h3>Integraci&oacute;n Continua (CI)</h3>
<p>Integraci&oacute;n Continua (CI) es una pr&aacute;ctica de desarrollo de software en la que los desarrolladores
    integran su c&oacute;digo de trabajo en un repositorio compartido de forma frecuente, generalmente varias veces al
    d&iacute;a. Cada integraci&oacute;n es verificada autom&aacute;ticamente mediante la construcci&oacute;n del
    software y la ejecuci&oacute;n de pruebas automatizadas, lo que ayuda a detectar errores en una etapa temprana del
    desarrollo.</p>
<h3>Objetivos de la Integraci&oacute;n Continua</h3>
<ul>
    <li>Detecci&oacute;n Temprana de Errores: Al integrar el c&oacute;digo con frecuencia, los problemas se detectan
        r&aacute;pidamente, lo que facilita la identificaci&oacute;n y correcci&oacute;n de errores en el c&oacute;digo.
    </li>
    <li>Menos Conflictos de Integraci&oacute;n: La integraci&oacute;n frecuente reduce la complejidad de la
        integraci&oacute;n, ya que los cambios son peque&ntilde;os y f&aacute;ciles de gestionar.</li>
    <li>Desarrollo M&aacute;s R&aacute;pido y Colaborativo: Los desarrolladores pueden colaborar de manera m&aacute;s
        eficiente, ya que el c&oacute;digo siempre est&aacute; disponible en un estado actualizado y funcional.</li>
    <li>Calidad de Software Consistente: La ejecuci&oacute;n autom&aacute;tica de pruebas asegura que el software cumpla
        consistentemente con los est&aacute;ndares de calidad.</li>
</ul>
<h3>Pr&aacute;cticas y Herramientas Comunes para CI</h3>
<ul>
    <li>Control de Versiones: Utilizaci&oacute;n de sistemas como Git, Subversion o Mercurial para gestionar y versionar
        el c&oacute;digo fuente.</li>
    <li>Automatizaci&oacute;n de la Construcci&oacute;n: Uso de herramientas como Jenkins, Travis CI, GitLab CI/CD,
        CircleCI, Azure Pipelines, y Bamboo para automatizar la construcci&oacute;n del software cada vez que se realiza
        una integraci&oacute;n.</li>
    <li>Pruebas Automatizadas: Implementaci&oacute;n de pruebas unitarias, pruebas de integraci&oacute;n, pruebas de
        aceptaci&oacute;n, etc., para verificar que el c&oacute;digo reci&eacute;n integrado no rompe la funcionalidad
        existente.</li>
    <li>Integraci&oacute;n de Revisiones de C&oacute;digo: Revisi&oacute;n del c&oacute;digo mediante "pull requests" o
        "merge requests" para asegurar que el c&oacute;digo cumpla con los est&aacute;ndares de calidad antes de ser
        integrado en la rama principal.</li>
</ul>
<h3>Despliegue Continuo (CD)</h3>
<p><strong>Despliegue Continuo (CD)</strong>: se refiere a dos pr&aacute;cticas diferentes dentro del ciclo de vida de
    desarrollo: Entrega Continua (Continuous Delivery) y Despliegue Continuo (Continuous Deployment). Aunque a menudo se
    usan indistintamente, hay una diferencia clave entre ellos:</p>
<p><strong>Entrega Continua (Continuous Delivery)</strong>: Significa que el c&oacute;digo se encuentra siempre en un
    estado listo para ser desplegado en producci&oacute;n. La diferencia es que el despliegue en producci&oacute;n es un
    paso manual que requiere la aprobaci&oacute;n de un desarrollador o de un equipo de operaciones.</p>
<p><strong>Despliegue Continuo (Continuous Deployment)</strong>: Aqu&iacute;, cada cambio que pasa las etapas
    automatizadas de pruebas es desplegado autom&aacute;ticamente en producci&oacute;n sin intervenci&oacute;n humana.
    Esta pr&aacute;ctica representa la automatizaci&oacute;n completa de todo el pipeline de entrega de software.</p>
<h3>Objetivos del Despliegue Continuo</h3>
<ul>
    <li>Automatizaci&oacute;n del Proceso de Despliegue: El proceso de despliegue est&aacute; completamente
        automatizado, lo que reduce la posibilidad de errores humanos.</li>
    <li>Entregas R&aacute;pidas y Frecuentes a Producci&oacute;n: Permite la entrega de nuevas funcionalidades,
        correcci&oacute;n de errores y mejoras de manera r&aacute;pida y continua, lo que facilita la adaptaci&oacute;n
        a las necesidades del mercado.</li>
    <li>Mayor Feedback y Retroalimentaci&oacute;n de Usuarios: Las actualizaciones frecuentes permiten recibir
        retroalimentaci&oacute;n de los usuarios m&aacute;s r&aacute;pidamente, lo que es esencial para el proceso de
        mejora continua.</li>
    <li>Minimizaci&oacute;n de Riesgos: Los despliegues frecuentes de cambios peque&ntilde;os reducen el riesgo de
        grandes fallos en producci&oacute;n. Si ocurre un problema, es m&aacute;s f&aacute;cil revertir o arreglar un
        cambio peque&ntilde;o.</li>
</ul>
<h3>Pr&aacute;cticas y Herramientas Comunes para CD</h3>
<p><strong>Pipeline de CI/CD</strong>: Configuraci&oacute;n de un pipeline que abarca las etapas de construcci&oacute;n,
    pruebas, y despliegue. Herramientas como Jenkins, GitLab CI/CD, Travis CI, CircleCI, Spinnaker, y Azure DevOps
    Pipelines son com&uacute;nmente utilizadas.</p>
<p><strong>Infraestructura como C&oacute;digo (IaC)</strong>: Uso de herramientas como Terraform, Ansible, Chef, y
    Puppet para gestionar la infraestructura de manera program&aacute;tica, permitiendo la consistencia y la
    automatizaci&oacute;n en los entornos de despliegue.</p>
<p><strong>Pruebas Automatizadas de Aceptaci&oacute;n y Pruebas en Producci&oacute;n</strong>: Adem&aacute;s de pruebas
    unitarias e integraci&oacute;n, se implementan pruebas funcionales, de rendimiento y seguridad para garantizar que
    el software est&eacute; listo para producci&oacute;n.</p>
<p><strong>T&eacute;cnicas de Despliegue Seguro</strong>: M&eacute;todos como Canary Releases (despliegue gradual a un
    peque&ntilde;o porcentaje de usuarios), Blue-Green Deployment (tener dos entornos de producci&oacute;n
    id&eacute;nticos y cambiar entre ellos), y Rolling Updates (actualizar la aplicaci&oacute;n en partes) son
    utilizados para minimizar el impacto y riesgos.</p>
<h3>Beneficios Combinados de CI/CD</h3>
<ul>
    <li>Reducci&oacute;n del Tiempo de Entrega de Software: Elimina los cuellos de botella del proceso de despliegue,
        permitiendo una entrega r&aacute;pida y continua.</li>
    <li>Mejora de la Calidad del Software: La integraci&oacute;n continua de c&oacute;digo y pruebas automatizadas
        asegura que los problemas sean detectados temprano, mejorando la calidad general del software.</li>
    <li>Mayor Innovaci&oacute;n y Productividad del Equipo: Al automatizar procesos repetitivos, los equipos pueden
        enfocarse en tareas de mayor valor agregado, como la creaci&oacute;n de nuevas funcionalidades y mejoras.</li>
    <li>Feedback Continuo: Facilita la recopilaci&oacute;n de retroalimentaci&oacute;n del usuario y de
        producci&oacute;n en ciclos r&aacute;pidos, lo que permite mejoras y correcci&oacute;n de errores m&aacute;s
        eficientes.</li>
    <li>Reducci&oacute;n del Riesgo: Los despliegues frecuentes de cambios peque&ntilde;os permiten una r&aacute;pida
        identificaci&oacute;n de problemas, facilitando la recuperaci&oacute;n r&aacute;pida y la reducci&oacute;n de
        riesgos.</li>
</ul>
<h3>Conclusi&oacute;n</h3>
<p>CI/CD son pr&aacute;cticas fundamentales en DevOps que, cuando se implementan correctamente, permiten a las
    organizaciones entregar software de manera r&aacute;pida, eficiente y con alta calidad. La combinaci&oacute;n de CI
    y CD impulsa la cultura de colaboraci&oacute;n, mejora continua y respuesta r&aacute;pida a los cambios del mercado,
    lo que se traduce en una ventaja competitiva significativa.</p>